soapIn.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cat="http://tempuri.org/CatalystDeveloperService/CatalystEcommerceWebservice"><soap:Header/><soap:Body><cat:Product_UpdateInsert><cat:username xmlns:cat="http://tempuri.org/CatalystDeveloperService/CatalystEcommerceWebservice">autoevozon3master@bcmail.ro</cat:username><cat:password xmlns:cat="http://tempuri.org/CatalystDeveloperService/CatalystEcommerceWebservice">password</cat:password><cat:siteId xmlns:cat="http://tempuri.org/CatalystDeveloperService/CatalystEcommerceWebservice">201974</cat:siteId><cat:productList xmlns:cat="http://tempuri.org/CatalystDeveloperService/CatalystEcommerceWebservice"><cat:Products><cat:productId>5012138</cat:productId><cat:productCode>D9SVAK8G7N</cat:productCode><cat:productName>productsss</cat:productName><cat:description/><cat:smallImage/><cat:largeImage/><cat:cataloguesArray><cat:string>/catalog parinte/</cat:string></cat:cataloguesArray><cat:pricesSaleArray/><cat:pricesRetailArray/><cat:pricesWholesaleArray/><cat:wholesaleTaxCodeArray/><cat:taxCodeArray/><cat:groupProducts/><cat:groupProductsDescriptions/><cat:supplierCommission>55</cat:supplierCommission><cat:weight>0</cat:weight><cat:relatedProducts/><cat:tags/><cat:unitType/><cat:minUnits>1</cat:minUnits><cat:onOrder>0</cat:onOrder><cat:inventoryControl>false</cat:inventoryControl><cat:canPreOrder>false</cat:canPreOrder><cat:custom1/><cat:custom2/><cat:custom3/><cat:custom4/><cat:popletImages/><cat:captureDetails>false</cat:captureDetails><cat:downloadLimitCount>0</cat:downloadLimitCount><cat:limitDownloadsToIP>0</cat:limitDownloadsToIP><cat:isOnSale>false</cat:isOnSale><cat:hideIfNoStock>false</cat:hideIfNoStock><cat:productAttributes/><cat:isGiftVoucher>false</cat:isGiftVoucher><cat:enableDropShipping>false</cat:enableDropShipping><cat:productHeight>0</cat:productHeight><cat:productDepth>0</cat:productDepth><cat:excludeFromSearch>false</cat:excludeFromSearch><cat:productTitle/><cat:cycletypeId>1</cat:cycletypeId><cat:cycletypeCount>-1</cat:cycletypeCount><cat:slug>productsss</cat:slug></cat:Products></cat:productList></cat:Product_UpdateInsert></soap:Body></soap:Envelope>